# 1. Напишите функцию которая будет суммировать введенные три случайные цифры.

def summa():
	num1 = int(input("Pls enter the num1: "))
	num2 = int(input("Pls enter the num2: "))
	num3 = int(input("Pls enter the num3: "))
	print("the sum of 3 num: ", num1+num2+num3, "\n")
	return summa

summa()
summa()